In [262]:
import pandas as pd

In [263]:
data = pd.read_csv("dataset_chaicode.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. J",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [264]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. J",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [265]:
data.head(14)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. J",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,0,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,0,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S

In [266]:
print(data.head)

<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                    Kelly, Mr. J    male  34.5      0      0
1                Wilkes, Mrs. James (ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]>

In [267]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [268]:
type(data)

pandas.core.frame.DataFrame

In [269]:
type(data['PassengerId'])

pandas.core.series.Series

In [270]:
type(data['Age'])

pandas.core.series.Series

In [271]:
data['PassengerId']

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [272]:
data['Name']

0                                      Kelly, Mr. J
1                  Wilkes, Mrs. James (ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [273]:
series_sclar = pd.Series(10, index=['a', 'b', 'd', 'f'])
print(series_sclar)

a    10
b    10
d    10
f    10
dtype: int64

In [274]:
series_sclar['a']

np.int64(10)

In [275]:
series_sclar = pd.Series(20.3)
series_sclar

0    20.3
dtype: float64

In [276]:
data = [10, 20, 30, 40, 50, 60, 70]
series_list = pd.Series(data)
print(series_list)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [277]:
import numpy as np
data_array = np.array(data)
series_custom_array = pd.Series(data_array, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
print(series_custom_array)

a    10
b    20
c    30
d    40
e    50
f    60
g    70
dtype: int64

In [278]:
data_dict = {'a':2, 'b':3, 'c':4, 'd':5, 'e':6}
print(pd.Series(data_dict))

a    2
b    3
c    4
d    5
e    6
dtype: int64

In [279]:
se3 = pd.Series(data_dict)
print(se3[0:3])

a    2
b    3
c    4
dtype: int64

In [280]:
data = ['New Delhi', 'Washington', 'London', 'Paris']
index = ['India', 'USA', 'UK', 'France']

series_capital_country = pd.Series(data, index)
series_capital_country

India      New Delhi
USA       Washington
UK            London
France         Paris
dtype: object

In [281]:
print("Index of the series_capital_country")
print(series_capital_country.index)

Index of the series_capital_country
Index(['India', 'USA', 'UK', 'France'], dtype='object')

In [282]:
print(series_capital_country.all())

True

In [283]:
print("Values of the series_capital_country")
print(series_capital_country.values)

Values of the series_capital_country
['New Delhi' 'Washington' 'London' 'Paris']

In [284]:
print("Data type of the series_capital_country")
print(series_capital_country.dtype)

Data type of the series_capital_country
object

In [285]:
print("shape of the series_capital_country")
print(series_capital_country.shape)

shape of the series_capital_country
(4,)

In [286]:
print("Size of the series_capital_country")
print(series_capital_country.size)

Size of the series_capital_country
4

In [287]:
print("is series_capital_country contains NaN?")
print(series_capital_country.hasnans)

is series_capital_country contains NaN?
False

In [288]:
print("is series_capital_country empty?")
print(series_capital_country.empty)

is series_capital_country empty?
False

In [289]:
print("is series_capital_country contains unique element")
print(series_capital_country.is_unique)

is series_capital_country contains unique element
True

In [290]:
print("Dimensions of the series_capital_country")
print(series_capital_country.ndim)

Dimensions of the series_capital_country
1

In [291]:
print(pd.Series())

Series([], dtype: object)

Methods in Series Data Structure

In [292]:
series_capital_country.head()

India      New Delhi
USA       Washington
UK            London
France         Paris
dtype: object

In [293]:
series_capital_country.tail(2)

UK        London
France     Paris
dtype: object

In [294]:
marks = [85, 60, 74, 66, 89, 91]
students = ['Ram', 'Priya', 'Rashmi', 'Vidushi', 'Mohit', 'Karan']

series_student = pd.Series(marks, index=students)
print(series_student)

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
Karan      91
dtype: int64

To get the descriptive statistics of the given data

In [295]:
series_student.describe()

count     6.000000
mean     77.500000
std      12.817956
min      60.000000
25%      68.000000
50%      79.500000
75%      88.000000
max      91.000000
dtype: float64

In [296]:
series_student.min()

np.int64(60)

In [297]:
series_student.max()

np.int64(91)

value_counts()

In [298]:
series_student.value_counts()

85    1
60    1
74    1
66    1
89    1
91    1
Name: count, dtype: int64

sort_values()

In [299]:
series_student.sort_values()

Priya      60
Vidushi    66
Rashmi     74
Ram        85
Mohit      89
Karan      91
dtype: int64

drop()

In [300]:
series_student.drop('Karan', inplace=True)

In [301]:
series_student

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
dtype: int64

isnull() -> Detect the missing values

In [302]:
series_student.isnull()

Ram        False
Priya      False
Rashmi     False
Vidushi    False
Mohit      False
dtype: bool

sum of all missing value

In [303]:
print(series_student.isnull().sum())

0

Addition of two Series

Subtraction of two Series

Multiplication of two Series

Division of two Series

In [304]:
series1 = pd.Series([1, 2, 3, 4, 5])
series2 = pd.Series([5, 4, 3, 2, 1])

print(series1 + series2)
print(series1 - series2)

0    6
1    6
2    6
3    6
4    6
dtype: int64
0   -4
1   -2
2    0
3    2
4    4
dtype: int64

In [305]:
print(series1 * series2)

0    5
1    8
2    9
3    8
4    5
dtype: int64

In [306]:
print(series1 / series2)

0    0.2
1    0.5
2    1.0
3    2.0
4    5.0
dtype: float64

In [307]:
print(series2 / series1)

0    5.0
1    2.0
2    1.0
3    0.5
4    0.2
dtype: float64

In [308]:
import pandas as pd

In [309]:
import pandas as pd
data1 = pd.read_csv("customers.csv")
print(data1)

       id first_name    last_name                           email  gender  \
0       1     Romain    Southcott       rsouthcott0@clickbank.net    Male
1       2     Cosimo    Molyneaux           cmolyneaux1@wiley.com    Male
2       3      Bambi      Westrip          bwestrip2@symantec.com  Female
3       4     Roarke   Pankettman          rpankettman3@wiley.com    Male
4       5    Mikaela     Althorpe                malthorpe4@51.la     NaN
..    ...        ...          ...                             ...     ...
995   996    Merrili        Alman            malmanrn@cornell.edu  Female
996   997    Winonah       Heckle               whecklero@fc2.com  Female
997   998      Tobit         Birt                             NaN    Male
998   999     Issiah  Standbrooke  istandbrookerq@yellowpages.com    Male
999  1000     Elmore       Malpas                             NaN    Male

     street_num street_name street_suffix          city         state  \
0           1.0   Trailsway          Road     San Diego    California
1           NaN         NaN           NaN       El Paso         Texas
2        4057.0    Arkansas        Circle   San Antonio         Texas
3          74.0        Debs         Point       Memphis     Tennessee
4           NaN         2nd         Drive           NaN           NaN
..          ...         ...           ...           ...           ...
995         0.0    Thompson           Way       Reading  Pennsylvania
996       701.0     Rowland          Hill  Indianapolis       Indiana
997         2.0       Basil          Road     Waterbury   Connecticut
998         NaN     Kenwood         Drive      Savannah       Georgia
999       205.0     Farwell          Park       Atlanta       Georgia

     postcode
0     92127.0
1         NaN
2     78220.0
3     38150.0
4     83732.0
..        ...
995   19610.0
996   46278.0
997    6721.0
998   31405.0
999   30386.0

[1000 rows x 11 columns]

In [310]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             1000 non-null   int64
 1   first_name     1000 non-null   object
 2   last_name      1000 non-null   object
 3   email          878 non-null    object
 4   gender         957 non-null    object
 5   street_num     738 non-null    float64
 6   street_name    963 non-null    object
 7   street_suffix  963 non-null    object
 8   city           921 non-null    object
 9   state          920 non-null    object
 10  postcode       843 non-null    float64
dtypes: float64(2), int64(1), object(8)
memory usage: 86.1+ KB

In [311]:
data1.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0

In [312]:
df = pd.read_csv("customers.csv")
print(df)

       id first_name    last_name                           email  gender  \
0       1     Romain    Southcott       rsouthcott0@clickbank.net    Male
1       2     Cosimo    Molyneaux           cmolyneaux1@wiley.com    Male
2       3      Bambi      Westrip          bwestrip2@symantec.com  Female
3       4     Roarke   Pankettman          rpankettman3@wiley.com    Male
4       5    Mikaela     Althorpe                malthorpe4@51.la     NaN
..    ...        ...          ...                             ...     ...
995   996    Merrili        Alman            malmanrn@cornell.edu  Female
996   997    Winonah       Heckle               whecklero@fc2.com  Female
997   998      Tobit         Birt                             NaN    Male
998   999     Issiah  Standbrooke  istandbrookerq@yellowpages.com    Male
999  1000     Elmore       Malpas                             NaN    Male

     street_num street_name street_suffix          city         state  \
0           1.0   Trailsway          Road     San Diego    California
1           NaN         NaN           NaN       El Paso         Texas
2        4057.0    Arkansas        Circle   San Antonio         Texas
3          74.0        Debs         Point       Memphis     Tennessee
4           NaN         2nd         Drive           NaN           NaN
..          ...         ...           ...           ...           ...
995         0.0    Thompson           Way       Reading  Pennsylvania
996       701.0     Rowland          Hill  Indianapolis       Indiana
997         2.0       Basil          Road     Waterbury   Connecticut
998         NaN     Kenwood         Drive      Savannah       Georgia
999       205.0     Farwell          Park       Atlanta       Georgia

     postcode
0     92127.0
1         NaN
2     78220.0
3     38150.0
4     83732.0
..        ...
995   19610.0
996   46278.0
997    6721.0
998   31405.0
999   30386.0

[1000 rows x 11 columns]

In [313]:
print(df[['first_name', 'email', 'state']])

    first_name                           email         state
0       Romain       rsouthcott0@clickbank.net    California
1       Cosimo           cmolyneaux1@wiley.com         Texas
2        Bambi          bwestrip2@symantec.com         Texas
3       Roarke          rpankettman3@wiley.com     Tennessee
4      Mikaela                malthorpe4@51.la           NaN
..         ...                             ...           ...
995    Merrili            malmanrn@cornell.edu  Pennsylvania
996    Winonah               whecklero@fc2.com       Indiana
997      Tobit                             NaN   Connecticut
998     Issiah  istandbrookerq@yellowpages.com       Georgia
999     Elmore                             NaN       Georgia

[1000 rows x 3 columns]

In [314]:
df.isnull()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,True,True,False,False,True
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,True,True,False,False,True,True,False
...,...,...,...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False,False,False,False
997,False,False,False,True,False,False,False,False,False,False,False
998,False,False,False,False,False,True,False,False,False,False,False
999,False,False,False,True,False,False,False,False,False,False,False

In [315]:
df['country'] = 'usa'
df

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,country
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,usa
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,usa
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,usa
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,usa
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,usa
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Merrili,Alman,malmanrn@cornell.edu,Female,0.0,Thompson,Way,Reading,Pennsylvania,19610.0,usa
996,997,Winonah,Heckle,whecklero@fc2.com,Female,701.0,Rowland,Hill,Indianapolis,Indiana,46278.0,usa
997,998,Tobit,Birt,NaN,Male,2.0,Basil,Road,Waterbury,Connecticut,6721.0,usa
998,999,Issiah,Standbrooke,istandbrookerq@yellowpages.com,Male,NaN,Kenwood,Drive,Savannah,Georgia,31405.0,usa
999,1000,Elmore,Malpas,NaN,Male,205.0,Farwell,Park,Atlanta,Georgia,30386.0,usa

In [316]:
data = df

In [317]:
data['Full_name'] = data['first_name'] + ' ' + data['last_name']
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,country,Full_name
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,usa,Romain Southcott
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,usa,Cosimo Molyneaux
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,usa,Bambi Westrip
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,usa,Roarke Pankettman
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,usa,Mikaela Althorpe

In [318]:
dataframe_demo = {
    'Name' : ['Ajit', 'Amit', 'Abhishek', 'Akash', 'Aman'],
    'Age' : [18, 22, 20, 35, 55],
    'City' : ['Delhi', 'Ara', 'Khagaria', 'Khagaria', 'Bhagalpur']
}

dataframe_demo = pd.DataFrame(dataframe_demo, index=['a', 'b', 'c', 'd', 'e'])
dataframe_demo

       Name  Age       City
a      Ajit   18      Delhi
b      Amit   22        Ara
c  Abhishek   20   Khagaria
d     Akash   35   Khagaria
e      Aman   55  Bhagalpur

In [319]:
dataframe_demo.loc['b']

Name    Amit
Age       22
City     Ara
Name: b, dtype: object

In [321]:
dataframe_demo.loc[['b', 'c']]

       Name  Age      City
b      Amit   22       Ara
c  Abhishek   20  Khagaria